{
  "server": "ia600705.us.archive.org",
  "dir": "/12/items/Airstrike2",
  "metadata": {
	"mediatype": [
	  "software"
	],
	"collection": [
	  "classicpcgames"
	],
	"title": [
	  "AirStrike 2 Demo"
	],
	"description": [
	  "AirStrike 2 is finally here. Get ready for brand new land, air and water units, armored vehicles, heavy helicopters, submarines, destroyers, carriers, speedboats. Missions take place over water, desert, high in the mountains and over densely populated areas. While the enemies have become tougher and more deadly, players can now upgrade and modify weapons themselves to meet the challenge. The level of details for 3D objects is incredibly high, so when you clinch the trigger to blow things up, they fly apart into hundreds of small pieces. Now the iron birdies with deadly claws and beaks each have a set of unique characteristics. These Death Machines are armed with lethal weapons that the UN has outlawed long ago. One flying monster could probably carry out genocide in a few small countries with hard-to-pronounce names. Most importantly, now you can participate in air battles to test your pilot skills against your enemiesâ. Helicopter duels are both incredibly challenging and engaging, making your palms sweat and your hurt pump the blood-adrenaline mixture all over the body to give you the energy for survival. But when you see all other birdies lose their wings and crash down, thatâs how nirvana feels like. In addition to new terrain types and environments, AirStrike 2 features terramorphing, which changes the landscape as a direct result of your actions. Plus, after passing a level and killing its boss, you can fly through bonus levels to empty your adrenaline tanks and release the unused rage. Simply fly and kill for fun and pleasure, while getting ready for the next missions. By the way, each mission in AirStrike 2 is preceded by a small briefing, and radio communications with the command center are carried out on a regular basis to keep you engaged. Last year Game Tunnel nominated AirStrike 3D for Best Action Game, Best Sound, Best Graphics and Best Non-Network Multiplayer. Theyâll have to come up with new categories this year for AirStrike 2."
	],
	"subject": [
	  "Windows games; Vintage computer games; Action games"
	],
	"creator": [
	  "DivoGames"
	],
	"identifier": [
	  "Airstrike2"
	],
	"addeddate": [
	  "2012-05-28 18:40:00"
	],
	"publicdate": [
	  "2012-05-28 18:40:20"
	],
	"date": [
	  "2004"
	],
	"year": [
	  "2004"
	],
	"noarchivetorrent": [
	  "true"
	],
	"curation": [
	  "[curator]validator@archive.org[\/curator][date]20140407234123[\/date][comment]checked for malware[\/comment]"
	],
	"backup_location": [
	  "ia903804_6"
	]
  },
  "files": {
	"\/AirStrike2Setup.exe": {
	  "source": "original",
	  "format": "Windows Executable",
	  "mtime": "1338229817",
	  "size": "23723708",
	  "md5": "a5951410a8e9b673f118d7209e769ec8",
	  "crc32": "6d11146e",
	  "sha1": "77a88aae4fc8af084ac0eb6b32601635efdbb13e"
	},
	"\/AirStrike2Setup.jpg": {
	  "source": "original",
	  "format": "JPEG",
	  "mtime": "1338229818",
	  "size": "100054",
	  "md5": "eb0ae041cd9c8a7e7a88da1316bc8d2d",
	  "crc32": "bd304e4c",
	  "sha1": "f74132b549a045ba2470cd5f6ae170ad2ead85f4",
	  "rotation": "0"
	},
	"\/AirStrike2Setup_thumb.jpg": {
	  "source": "derivative",
	  "format": "JPEG Thumb",
	  "original": "AirStrike2Setup.jpg",
	  "mtime": "1338230415",
	  "size": "6116",
	  "md5": "0ef2d04083d5283f693c840fa33a4f1c",
	  "crc32": "06373bd3",
	  "sha1": "481d04539015dcf585ab0ffa52c7e4367a788af8"
	},
	"\/Airstrike2_files.xml": {
	  "source": "original",
	  "format": "Metadata",
	  "md5": "e8904661ea83aafbbcbc97c772a904e2"
	},
	"\/Airstrike2_meta.xml": {
	  "source": "original",
	  "format": "Metadata",
	  "mtime": "1464938730",
	  "size": "2718",
	  "md5": "4cfb0d3c87125df449099f18708c8dd6",
	  "crc32": "e82c4fa9",
	  "sha1": "7d8d2a244d04b84f2d89f35f87ae95bfa3fae5cf"
	}
  },
  "misc": {
	"image": "https:\/\/ia600705.us.archive.org\/12\/items\/Airstrike2\/AirStrike2Setup_thumb.jpg",
	"collection-title": "Classic PC Games"
  },
  "item": {
	"downloads": 1221,
	"week": 10,
	"month": 28
  }
}