{
  "server": "ia600808.us.archive.org",
  "dir": "/12/items/AresRisingDemo",
  "metadata": {
	"identifier": [
	  "AresRisingDemo"
	],
	"title": [
	  "Ares Rising Demo"
	],
	"creator": [
	  "Imagine Studios"
	],
	"mediatype": [
	  "software"
	],
	"collection": [
	  "classicpcgames"
	],
	"description": [
	  "Dear Mr. Marlowe,\n\nCongratulations on your decision to join the IPEC family.  I think you'll find that the advantages of working for a corporation-state - advantages such as security, stability and credit-worthiness - far outweigh the alleged disadvantages so often touted by anti-corporate agitators.  There are a number of issues I would like to briefly mention before you assume your contractual duties.\n\nI remind you that you have just signed a legally binding and exclusive employment contract with IPEC.  Freelancing for other corporations is frowned upon and operating against IPEC interests at any time is strictly forbidden.  If IPEC should discover that you have ever, knowingly or unknowingly, operated against IPEC's corporate interests, your contract will be terminated and you will be subject to civil and criminal sanctions the severity of which will be determined by Emperor Radivic Karadescu.\n\nYou should also remember that IPEC has demonstrated exceptional good faith in providing you with a secure base of operations concealed within a large asteroid due to your special need for security.  Be advised that this concession is unusual in the extreme, especially since you haven't even passed your Competency Threshold Runs yet.  You should bear in mind at all times that this base remains the exclusive property of IPEC.  In occupying the base, you concede that no tenant's rights, squatter's rights or any other rights have been granted or implied to you by IPEC relative to said occupancy.  Furthermore, you are responsible for maintaining the base in pristine condition.  You are responsible for defending the base against attackers.  \n\nYou will be required to vacate the base within one hour's notice at all times.  Failure to fulfill any of these obligations will result in the termination of your contract and the application of sanctions as detailed in the preceding paragraph.\nPlease feel free to consult the Series 9000 computer located aboard your base if you have any further questions.  The Series 9000 database contains all the information you will require concerning the different ships you will fly, weapons you may acquire and civilizations you may encounter.  Use this information for the betterment of IPEC and you will go far.\n\nLastly, please remember that at IPEC, We Care About You.\n\nWelcome to your new home!"
	],
	"date": [
	  "1998"
	],
	"year": [
	  "1998"
	],
	"subject": [
	  "Windows games; Vintage computer games; Action games"
	],
	"publicdate": [
	  "2012-02-14 23:31:53"
	],
	"addeddate": [
	  "2012-02-14 23:30:01"
	],
	"updater": [
	  "Swizzley",
	  "Swizzley"
	],
	"updatedate": [
	  "2012-02-14 23:31:53",
	  "2012-02-16 00:10:22"
	],
	"publisher": [
	  "Imagine Studios"
	],
	"curation": [
	  "[curator]jscott@archive.org[\/curator][date]20140308004704[\/date][state]un-dark[\/state][comment]Darked by Mistake[\/comment]"
	],
	"backup_location": [
	  "ia903708_35"
	]
  },
  "files": {
	"\/AresRisingDemo.zip": {
	  "source": "original",
	  "format": "ZIP",
	  "title": "Ares Rising Demo",
	  "mtime": "1329262147",
	  "size": "52734732",
	  "md5": "7a98585ec93ab28ce5a2f0a74ed6e970",
	  "crc32": "cc8d99cb",
	  "sha1": "8274f09c775c93ce5807f0cdd8c97239a509f017"
	},
	"\/AresRisingDemo_archive.torrent": {
	  "source": "original",
	  "btih": "480efc713e6b842d0bf3a6387d616bd34ce48122",
	  "mtime": "1464943907",
	  "size": "3673",
	  "md5": "aabec6774f57eeec1a57b7e4c419650b",
	  "crc32": "914785e2",
	  "sha1": "c50149d2c6815bf3176cb5fc26355a076e4f20a8",
	  "format": "Archive BitTorrent"
	},
	"\/AresRisingDemo_files.xml": {
	  "source": "original",
	  "format": "Metadata",
	  "md5": "cf27695b8575275f98c5b5db88486308"
	},
	"\/AresRisingDemo_meta.xml": {
	  "source": "original",
	  "format": "Metadata",
	  "mtime": "1464943905",
	  "size": "3264",
	  "md5": "b24baf4dcdaef8a682448315cdeeaa66",
	  "crc32": "9b94ac6d",
	  "sha1": "9863b09db662593559845791a1b3a14a878f55dc"
	},
	"\/AresRisingScreenshot.jpg": {
	  "source": "original",
	  "format": "JPEG",
	  "title": "Ares Rising Screenshot",
	  "mtime": "1329262332",
	  "size": "31385",
	  "md5": "a039592a6872c3072f023a14c94da558",
	  "crc32": "123157fe",
	  "sha1": "7cfa432bfe57ee99874a9dc7f506cb17947d8858",
	  "rotation": "0"
	}
  },
  "misc": {
	"image": "https:\/\/ia600808.us.archive.org\/12\/items\/AresRisingDemo\/AresRisingScreenshot.jpg",
	"collection-title": "Classic PC Games"
  },
  "item": {
	"downloads": 125,
	"week": 4,
	"month": 5
  }
}