{
  "server": "ia800809.us.archive.org",
  "dir": "/5/items/DriverDemo",
  "metadata": {
	"identifier": [
	  "DriverDemo"
	],
	"title": [
	  "Driver Demo"
	],
	"creator": [
	  "Reflections Interactive"
	],
	"mediatype": [
	  "software"
	],
	"collection": [
	  "classicpcgames"
	],
	"description": [
	  "GT Interactive's new game, Driver for the PC puts gamers right into the middle of the action and squarely behind the wheel of the most wanted getaway car. Driver delivers the clutch-your-seats, adrenaline-charged action of a heart-stopping, Hollywood-style car chase, propelling players along a high-speed, all-out thrill ride through the wild streets of four major U.S. cities.\n\nDriver's true-to-life modeling of automobile physics, ultra-realistic environments, cutting-edge graphics and revolutionary replay mode allow users to experience the most elaborate, realistic interactive driving experience imaginable.\n\nAssuming the identity of an undercover cop named Tanner, players sell their services as a driver-for-hire to the highest bidder in order to infiltrate a powerful crime ring spanning four of the nation's largest cities - New York, Los Angeles, San Francisco, and Miami.\n\nExtensive pre-production filming of each city brings home an unprecedented level of realism to the interactive arena, where players can clearly pick out such notable landmarks as the Empire State Building, Golden Gate Bridge and South Beach. In addition, each city has working traffic lights, wandering pedestrians who manage to get in the way, moving traffic and vigilant cops on patrol, making getaways more challenging and dynamic, immersing the player into a world that lives life on the edge.\n\nDriver comes fully equipped with a revolutionary replay\/director mode that gives players all the necessary tools to \"film\" their own car chase. After completing each mission, Driver allows players to go back through a virtual recording of their mind-numbing getaway, reposition camera angles and placements, and even re-cut scenes using editing tools.\n\nBut a great getaway driver is only as good as his equipment. That's why Driver has a selection of 70's style slam-you-back-into-your-seats raw power, performance-packed, muscle cars. Players experience realistic car handling, complete with damage modeling and true, real-world physics reactions on all cars. The cars lose tires during high-speed cornering and crash and deform when they slam into objects. Further enhancing the white-knuckle experience of Driver is the ability to change views on the fly. Multiple views allow the player to experience the pedal-to-the-metal action from behind the dashboard, where players can look out both side windows for an escape route, or check things out from a third person, behind-the-car perspective"
	],
	"date": [
	  "1999"
	],
	"year": [
	  "1999"
	],
	"subject": [
	  "Windows games; Vintage computer games; Racing games"
	],
	"publicdate": [
	  "2012-02-21 08:40:48"
	],
	"addeddate": [
	  "2012-02-21 08:40:30"
	],
	"publisher": [
	  "GT Interactive Software"
	],
	"updatedate": [
	  "2012-02-21 08:41:42"
	],
	"updater": [
	  "Swizzley"
	],
	"curation": [
	  "[curator]jscott@archive.org[\/curator][date]20140308004704[\/date][state]un-dark[\/state][comment]Darked by Mistake[\/comment]"
	],
	"backup_location": [
	  "ia903709_7"
	]
  },
  "files": {
	"\/DriverDemo.zip": {
	  "source": "original",
	  "format": "ZIP",
	  "title": "Driver Demo",
	  "mtime": "1329813601",
	  "size": "15711165",
	  "md5": "b2fae3fa045f0d77fdece64026ecef0c",
	  "crc32": "8d760f67",
	  "sha1": "1f690d516e7dad792ac5c1f5ce43a65c3b178a36"
	},
	"\/DriverDemo_archive.torrent": {
	  "source": "original",
	  "btih": "c37f60e7b71d49a2e409c1a936f4b8ed3db2b14d",
	  "mtime": "1462092369",
	  "size": "2410",
	  "md5": "913fe339463c55f0f9df7eb7cb1025aa",
	  "crc32": "a4b0af95",
	  "sha1": "7eee23eff1dcf5d7a9122931dbb4f8d94ddd0456",
	  "format": "Archive BitTorrent"
	},
	"\/DriverDemo_files.xml": {
	  "source": "original",
	  "format": "Metadata",
	  "md5": "331d04001641ffe3cdebde59abd4715d"
	},
	"\/DriverDemo_meta.xml": {
	  "source": "original",
	  "format": "Metadata",
	  "mtime": "1462092369",
	  "size": "3325",
	  "md5": "8fa3141186a1babb35e966d5012d5bac",
	  "crc32": "4179661d",
	  "sha1": "c4b3f2524fcfb46f863b9790efbbaf51d9dc028d"
	},
	"\/DriverScreenshot.jpg": {
	  "source": "original",
	  "format": "JPEG",
	  "title": "Driver Screenshot",
	  "mtime": "1329813602",
	  "size": "113340",
	  "md5": "57df9452fe91923bb8a61d7108e59937",
	  "crc32": "25d149cb",
	  "sha1": "f28c2623cb1309031adb2a9e8ad0db0a9bd2042d",
	  "rotation": "0"
	},
	"\/DriverScreenshot_thumb.jpg": {
	  "source": "derivative",
	  "format": "JPEG Thumb",
	  "original": "DriverScreenshot.jpg",
	  "mtime": "1329813641",
	  "size": "5354",
	  "md5": "f394f803240663a529b7afff02c58e44",
	  "crc32": "82372b3e",
	  "sha1": "45fc8c511fc43b8c788cfea51682b7690564afad"
	}
  },
  "misc": {
	"image": "https:\/\/ia600809.us.archive.org\/5\/items\/DriverDemo\/DriverScreenshot_thumb.jpg",
	"collection-title": "Classic PC Games"
  },
  "item": {
	"downloads": 3089,
	"week": 31,
	"month": 149
  }
}