{
  "server": "ia600906.us.archive.org",
  "dir": "/17/items/Gogodemo.",
  "metadata": {
	"identifier": [
	  "Gogodemo."
	],
	"mediatype": [
	  "software"
	],
	"collection": [
	  "classicpcgames"
	],
	"creator": [
	  "GOGO.NET"
	],
	"date": [
	  "1997"
	],
	"description": [
	  "<div>3D Action\/Adventure thriller which parodies the 1950's era Sci-fi genera movies and puts the player in control of their own destiny as they attempt to out wit and \/ or battle their way past evermore treacherous and perilous life threatening encounters.<\/div><div><br \/><\/div><div>The real-time 3D environment, with fully articulated player character(s) - you choose between male or female - and enemy creatures, high definition graphics, 3 dimensional \/ stereo sound, and 10 levels of complex 3D interactive physical puzzle construction guaranties a rich and rewarding game playing experience for both the young and old, male or female player.<\/div><div><br \/><\/div><div>Currently over halfway through the development phase and preparing for alpha testing, the game has already received favorable industry reviews and ready for publisher evaluation. <\/div>"
	],
	"named-persons": [
	  "Bill Narum"
	],
	"scanner": [
	  "Internet Archive HTML5 Uploader 1.4"
	],
	"subject": [
	  "Windows games; Vintage computer games; Action games"
	],
	"title": [
	  "The Incredible Shrinking Character Demo"
	],
	"year": [
	  "1997"
	],
	"publicdate": [
	  "2013-07-20 12:09:19"
	],
	"addeddate": [
	  "2013-07-20 12:09:19"
	],
	"notes": [
	  "This demo has been trimmed down from the actual game build...Level 8 begins with your character having jumped from a mouse hole into an opening in the back of one of the doctor's radio devices...Do not turn back as you will fall from the table to your death ...\n\nLight a match (\"M\" key) and continue onward into the laboratory (press the right mouse button to move forward, hold the \"shift\" key to run, \"ctrl\" to back-up, \"space bar\" to jump)...You will find more matches somewhere in the doctor's lab...\n\nBe warned you will also encounter an angry lizard which will begin to pursue you once he is disturbed - hitting him with a match (press the left mouse button) will get his attention, the more times he is hit the more intimidated he becomes...Visiting the brain in the jar is entertaining but be careful, it takes skill and accurate timing to jump back out...To exit or pause the demo use \"F10\" key...\n\nThere are some known bugs in this version which will be corrected in future releases, if the demo fails to run use \"alt, ctrl, delete\" to escape...The demo will run full screen or in a window, press \"enter\" plus \"alt\" keys to toggle between screens and the \"[\" or \"]\" keys to change resolution.\n\nThis demo is a very scaled down version of the game which has been simplified to facilitate game play since this level would be too difficult to play without the experience gained in the previous 7 levels...Your character will not die or receive damage in this version...In the actual game you will be able to play either a male or female character and can choose between first and third person point of view...We will be updating the demo to include the characters soon...Also look forward to continual updates to the game play plus inclusion of 3D sound and special effects which will be forth coming..\n\n--\n\nYou will need to have the ISCG demo loaded to play SUBMISSION - unzip the SUBMISSION demo, replace the \"GOGODEMO.SS\" file and the \"SLAMLOGO.BMP\" file in your \"GOGODEMO\" folder, add the two \".dmt\" files to the \"gogotext\" folder. Controls are the same as for I.S.C.G., however, you can also elevate the sub with the Tab key."
	],
	"url": [
	  "http:\/\/www.gogoagogo.com\/gogocom\/iscg\/iscgame1.htm"
	],
	"noarchivetorrent": [
	  "true"
	],
	"curation": [
	  "[curator]validator@archive.org[\/curator][date]20140407233910[\/date][comment]checked for malware[\/comment]"
	],
	"backup_location": [
	  "ia905703_30"
	]
  },
  "files": {
	"\/Gogodemo._files.xml": {
	  "source": "original",
	  "format": "Metadata",
	  "md5": "85f3d1ceea186b685c92146d4997af07"
	},
	"\/Gogodemo._meta.sqlite": {
	  "source": "original",
	  "format": "Metadata",
	  "mtime": "1374322173",
	  "size": "14336",
	  "md5": "f68e00b2cd5954e4ca8218a3d23a9eb9",
	  "crc32": "d1ff17e5",
	  "sha1": "fc507b70fe6401ab3e2ee4833040da7afd86772a"
	},
	"\/Gogodemo._meta.xml": {
	  "source": "original",
	  "format": "Metadata",
	  "mtime": "1476439649",
	  "size": "4012",
	  "md5": "c940f843d96daec4f5effd5bcd1224b1",
	  "crc32": "c6a8fa74",
	  "sha1": "9ecb4c8c2757a8387331353cd477d7b7d6027f72"
	},
	"\/gogodemo..jpg": {
	  "source": "original",
	  "format": "JPEG",
	  "mtime": "1374322159",
	  "size": "21420",
	  "md5": "b1b071a6d756e4f5ef6151a7fa9e89ad",
	  "crc32": "c17adc3d",
	  "sha1": "611d380b30fe766a5dc9c5d1269ddb72e948663c",
	  "rotation": "0"
	},
	"\/gogodemo._thumb.jpg": {
	  "source": "derivative",
	  "format": "JPEG Thumb",
	  "original": "gogodemo..jpg",
	  "mtime": "1374322182",
	  "size": "4703",
	  "md5": "b8b58aa97b01dfbb1d045d9523e91198",
	  "crc32": "698b8412",
	  "sha1": "f2d3b06310cbb76214848152c3cd0e557b109292"
	},
	"\/gogodemo.zip": {
	  "source": "original",
	  "format": "ZIP",
	  "mtime": "1374322168",
	  "size": "1067581",
	  "md5": "b955929c0920474695a9178bd89d6b18",
	  "crc32": "ea357fd0",
	  "sha1": "d68d963a4ef70f9459d70f5b21c2e6afdd2fe438"
	},
	"\/subdemo.zip": {
	  "source": "original",
	  "format": "ZIP",
	  "mtime": "1374322301",
	  "size": "145588",
	  "md5": "cd015f90e08baf8838edbf93fabff4ac",
	  "crc32": "5a217619",
	  "sha1": "a5c2f598e1ed7044d841192ca0c65dc075c8d2e5"
	}
  },
  "misc": {
	"image": "https:\/\/ia600906.us.archive.org\/17\/items\/Gogodemo.\/gogodemo._thumb.jpg",
	"collection-title": "Classic PC Games"
  },
  "item": {
	"downloads": 372,
	"week": 4,
	"month": 11
  }
}