{
  "server": "ia800507.us.archive.org",
  "dir": "/35/items/JamagicDemo",
  "metadata": {
	"identifier": [
	  "JamagicDemo"
	],
	"mediatype": [
	  "software"
	],
	"collection": [
	  "classicpcgames"
	],
	"creator": [
	  "Clickteam"
	],
	"date": [
	  "2003"
	],
	"description": [
	  "<div>DO YOU WANT TO ...<\/div><div><br \/><\/div><div>- Rapidly create commercial-quality 3D games for commercial distribution without royalties or per-title fees?<\/div><div>- Build complex applications, tools, etc., (with all the state-of-the-art, multimedia bells and whistles) without learning and mastering a complex, time-consuming language?<\/div><div>- Quickly prototype a commercial game proposal for an impressive and lucrative edge on your competition ... because time ALWAYS equals money?<\/div><div>- Create rich, addictive, multi-player online games in 2D or 3D, or with a combination of the two<\/div><div>Build incredible, eye popping, screensavers for promotions or clients?<\/div><div>- Or Maybe you just want to dabble in 3D game creation without major programming hassles or a big investment, while managing to shock yourself and impress every one you know in the process?<\/div><div><br \/><\/div><div>Then, you want Jamagic ... start creating your world!<\/div>"
	],
	"scanner": [
	  "Internet Archive HTML5 Uploader 1.6.3"
	],
	"subject": [
	  "Windows applications"
	],
	"title": [
	  "Jamagic 1.2 Demo"
	],
	"year": [
	  "2003"
	],
	"publicdate": [
	  "2015-06-08 22:06:27"
	],
	"addeddate": [
	  "2015-06-08 22:06:27"
	],
	"backup_location": [
	  "ia905306_25"
	]
  },
  "reviews": {
	"info": {
	  "num_reviews": 1,
	  "avg_rating": "3.00"
	},
	"reviews": [
	  {
		"reviewbody": "Ah what a blast from the past!\n\nI have to admit, I did cut my teeth with a bit of 3D programming and object oriented language with this thing, before my formal education on the topics, and this combined with ClickTeam's other product, The Games Factory, and my existing interest in video game development, contributed to my experience which made me excel in University in the relevant classes and landed me a job at Halfbrick Studios before I even graduated!\n\nThe sad thing is, if you wanted to make a decent game with this, you will eventually get bogged down with its bugs and general unreliability, and not very well thought out design, even if it was done with ambition.\n\nNearly all of the \"games\" you will find made for this are extremely basic, mostly 3D versions of simple arcade games, like driving, shooting, mazes etc.  The collision was too unreliable for anything more than this, from what I remember.\n\nI feel it was doomed from the start. It never went in the direction it should have and I suspect the right programmers and designers were not hired either.  I think with a better vision it may have had a chance, but there was an element of single-mindedness and inflexibility which was best displayed in one contentious topic - the name itself.\n\nI remember people (mostly native English speakers) complaining frequently about the poor choice of name.  It sounds clumsy, like \"Jumanji\" (that Robin Williams jungle movie) but no matter how many people complained, the creator  (was it Yves, or Francois? Can't remember) would post on the forums sticking to his guns, saying it was a good name, and we just have to get used to it.   Even years had passed and people still complained about it, even newcomers.\n\nSome English speakers on the forum who understood French even explained that pronouncing \"Jamagic\" would sound beautiful in French, which is why he likes it, but it doesn't sound good in English.  But he refused to listen.  There are reasons why some companies like to put in effort to pick names for their products that are comfortable in multiple languages (like the Wii) but this concept was lost on the creator.  Jamagic sounded good to him in French and that's all their was to it.\n\nWhen I started University I was in a class where the teacher asked me what I did, and when I said I was working on m own game, he asked what I was using. I remember cringing as I had to pronounce the name \"Jamagic\" - it's not something you can take seriously.  I could see in his face he was trying to give me the benefit of the doubt in spite of the name, it was kind of awkward.\n\nAnyway, that's my little anecdote.   They only had ONE programmer on the team, and he was overwhelmed with bugs and lost interest in the project, and left the job, and once he did, Jamagic stopped dead, and none of the creator's pleading for him to come back would change it.  (I heard on the forums that he sent an email to the programmer with the new bugs and asked if he would fix them, and he replied \"no\").\n\nI think he drastically underestimated just how much work making a game engine would be.  I think in retrospect, someone with a little bit more experience with any sort of software development or someone who could secure decent programmers and direct them well was sorely needed.\n\nIt certainly holds a bittersweet place in my memory - it worked well enough to program in an Object Oriented way and get some interaction happening, and I think others like me actually learned something from it.  It was also the first of its kind from what I remember - the only other entry level 3D game development engine was Blitz 3D, and that came out a year or so after Jamagic - it did well because it was an extension of Blitz Basic, a software series that had been running since the days of the Amiga and therefore had a lot of experience behind it, so in hindsight, Jamagic couldn't stand a chance against that in the long run.  In fact, it is still in development and people are still making Blitz Basic and Blitz 3D games to this day, under an open source version of the program.  I just wondered how things might have gone if I switched to that.  At the time I saw it come out, I'd already paid for Jamagic so I was financially and emotionally committed to it.  I think the major reason was it was based on Object Oriented Programming and I knew that was more relevant and future proof than basic.   So I made a sound choice at the time.  The fact is though, I probably would have completed an actual game using Blitz!\n\nIn summary, I think Jamagic had enough ambition and dedication but not quite enough talent or experience to avoid a death in a sea of bugs.\n\nJamagic left such a small foot note in game development history, that it doesn't even have a Wiki page devoted to it... just a sad little red link in Francois's Wikipedia page :(\n\nUltimately I feel it's lack of impact on history motivated me to do up a little review.  The thing existed and it did inspire us game developers to want to make 3D games and learn an OOP language, even if we had to go to another product in the end to further that learning.",
		"reviewtitle": "Was fun but ultimately not very useful",
		"reviewer": "Domarius",
		"reviewdate": "2017-03-08 23:30:09",
		"stars": "3"
	  }
	]
  },
  "files": {
	"\/Clipboard-20150608-04.png": {
	  "source": "original",
	  "mtime": "1433801200",
	  "size": "23516",
	  "md5": "5a243cacf0b475e11c40c389c452660d",
	  "crc32": "d36fc2ba",
	  "sha1": "3833fbbdb72ef3c8ad0b26e4520efea246a4ab9e",
	  "format": "PNG"
	},
	"\/Clipboard-20150608-04_thumb.jpg": {
	  "source": "derivative",
	  "format": "JPEG Thumb",
	  "original": "Clipboard-20150608-04.png",
	  "mtime": "1433801214",
	  "size": "3979",
	  "md5": "a59bbf0b8ae04ff723e7360b2a0d2f24",
	  "crc32": "ae047cb7",
	  "sha1": "28cde282aff6f60ec802dd657ca071b90f5c3742"
	},
	"\/JamagicDemo.exe": {
	  "source": "original",
	  "mtime": "1433801187",
	  "size": "23332312",
	  "md5": "ba4ccf3d36ffffada596054b1d7ede22",
	  "crc32": "6ba0ebe3",
	  "sha1": "015f8f7556fbbba0cb6e0ef611aa87fd5b76b924",
	  "format": "Windows Executable"
	},
	"\/JamagicDemo_archive.torrent": {
	  "source": "original",
	  "btih": "7bba394b725a7b902b777997dcee3132b00272cf",
	  "mtime": "1489015812",
	  "size": "2887",
	  "md5": "3ae8e3f0f019d16770d43f5acab5460c",
	  "crc32": "3244613c",
	  "sha1": "a1219bde8d4bdde1f784347235810d630fbb82d3",
	  "format": "Archive BitTorrent"
	},
	"\/JamagicDemo_files.xml": {
	  "source": "original",
	  "format": "Metadata",
	  "md5": "bd09d3b22de33141c479993ee58482b6"
	},
	"\/JamagicDemo_meta.sqlite": {
	  "source": "original",
	  "mtime": "1433801204",
	  "size": "16384",
	  "md5": "32385e79a4f599c5a4e553d8d6fa650c",
	  "crc32": "12d7bed3",
	  "sha1": "a8b0ac03cadabdbf86268c4c002b113336f529dd",
	  "format": "Metadata"
	},
	"\/JamagicDemo_meta.xml": {
	  "source": "original",
	  "mtime": "1484653237",
	  "size": "1697",
	  "format": "Metadata",
	  "md5": "039d2c7ce86c8d1b3b119f3f8f777625",
	  "crc32": "15b12e7a",
	  "sha1": "a7b4de783ce12ce3c1c5a43876994259a1c0254e"
	},
	"\/JamagicDemo_reviews.xml": {
	  "source": "original",
	  "mtime": "1489015811",
	  "size": "5562",
	  "md5": "c493ece8909af7c6d816d69d52ecc71d",
	  "crc32": "a19eaf1c",
	  "sha1": "836af0837133e0bac432e0bfdbc2f4ba7e575099",
	  "format": "Metadata"
	}
  },
  "misc": {
	"image": "https:\/\/ia800507.us.archive.org\/35\/items\/JamagicDemo\/Clipboard-20150608-04_thumb.jpg",
	"collection-title": "Classic PC Games"
  },
  "item": {
	"downloads": 308,
	"week": 6,
	"month": 16
  }
}