{
  "server": "ia600202.us.archive.org",
  "dir": "/5/items/PREVIEW_201402",
  "metadata": {
	"identifier": [
	  "PREVIEW_201402"
	],
	"mediatype": [
	  "software"
	],
	"collection": [
	  "classicpcgames"
	],
	"creator": [
	  "MegaMedia"
	],
	"date": [
	  "1999"
	],
	"description": [
	  "Venice Under Glass is a Basil Baker mystery adventure game which gives you a virtual tour of Venice, Italy. Venice Under Glass is a mystery story, adventure game, and education tour of Venice all rolled into one. You play Basil Baker, a lifelike teddy bear that runs a private detective outfit in California. Having been sent for by an old friend of the family who had long ago retired to Italy, you are, in fact, in Venice for business reasons. \"Uncle\" Clive was an avid collector of antique Venetian glass-- the old museum-quality pieces. These pieces have been mysteriously \"disappearing\" from his palazzo. He offered no other explanation, sounding rather astonished on the phone. It is Basil's first case since the New Year and he accepted the assignment eagerly, although he doesn't know a thing about Venetian glass - antique or otherwise. While a trip down the Grand Canal could have been, on another occasion leisurely, perhaps even romantic, it was on this occasion serious business.<div><br \/><div>Venice Under Glass will show you the panorama of Venice and will accustom you to the language, way of life, and people of Venice while you seek out the mystery behind the stolen goods. You'll learn interesting facts and have the adventure of a lifetime.<\/div><\/div>"
	],
	"scanner": [
	  "Internet Archive HTML5 Uploader 1.5.1"
	],
	"subject": [
	  "Windows games; Vintage computer games; Adventure games"
	],
	"title": [
	  "Venice Under Glass Demo"
	],
	"year": [
	  "1999"
	],
	"publicdate": [
	  "2014-02-14 17:28:36"
	],
	"addeddate": [
	  "2014-02-14 17:28:36"
	],
	"notes": [
	  "This game was never completed"
	],
	"noarchivetorrent": [
	  "true"
	],
	"curation": [
	  "[curator]validator@archive.org[\/curator][date]20140407234034[\/date][comment]checked for malware[\/comment]"
	],
	"backup_location": [
	  "ia905804_11"
	]
  },
  "reviews": {
	"info": {
	  "num_reviews": 1,
	  "avg_rating": "5.00"
	},
	"reviews": [
	  {
		"reviewbody": "My name is Stephan J Harper and I was President and sole shareholder in Megamedia, Inc, in 1999 when the demo of \"Venice Under Glass\" was produced in the Spring of that year. The game was based on a story I had written about Basil Baker, amateur sleuth - and teddybear - originally intended for print publication as an illustrated fantasy for all ages. I licensed the story and characters to Megamedia and directed all aspects of the game's production. We produced the demo that you can download from this site. At the time, the game was seen as revolutionary, combinging a point-and-click adventure game with pop-op 'EDUs' that contained educational information as well as embedded clues to the mystery for the players. We hired an educational consultant, an expert on Venice and it's history and culture, who wrote over 100 of these EDU elements. We received unanimous praise worldwide for what we were creating and Disney Interactive,  Mattel Interactive and Hasbro Interactive all expressed interest in publishing the game. However, the dotcom bust was upon us and all parties wanted Megamedia to fund the game to completion first. This was a departure from previous years of industry practice and with the seismic shift in the industry, raising another $2million dollars was impossible. Megamedia declared bankruptcy in February 2000. I want to personally thank the many game aficianados for their letters and comments I received from over 40 countries expressing admiration for the game as well as their disappointment that the game could not be brought to fruition. Ironically, a few months after the demo came out, we made a deal with Arete Software and had begun replacing all the water scenes with the new Arete water shader for Softimage 3D, the same shader used in the movie Titanic. The new scenes looked awesome. Flash forward 14 years and my story has been brought to life with iBooks Author in the new genre of Literature known as MultiTouch Fiction. You can download the free Sample (first 6 of 24 chapters at https:\/\/itunes.apple.com\/us\/book\/venice-under-glass\/id841148129?mt=11. The updates animations are wondrous and help tell Basil's story in a most unique format. Lastly, thank you to archive.org for keeping the game 'alive.' Kudos!",
		"reviewtitle": "Game Creator Here!",
		"reviewer": "StephanJHarper",
		"reviewdate": "2014-06-17 02:43:05",
		"stars": "5"
	  }
	]
  },
  "files": {
	"\/PREVIEW.EXE": {
	  "source": "original",
	  "format": "Windows Executable",
	  "mtime": "1392398915",
	  "size": "83257366",
	  "md5": "d080781140afd5e67ae09c36917bebe9",
	  "crc32": "f0cba260",
	  "sha1": "a81389291f741e903c3ec6b1526c34167cb39c73"
	},
	"\/PREVIEW_201402_files.xml": {
	  "source": "original",
	  "format": "Metadata",
	  "md5": "53c910d98a90ee27bbc6e484d33db157"
	},
	"\/PREVIEW_201402_meta.sqlite": {
	  "source": "original",
	  "format": "Metadata",
	  "mtime": "1392398938",
	  "size": "18432",
	  "md5": "80ad5f322d442569bc9ae120ffdb7c63",
	  "crc32": "153b187c",
	  "sha1": "5f4770c7e7ceadb4a82941ef6657b0d973dbf6b5"
	},
	"\/PREVIEW_201402_meta.xml": {
	  "source": "original",
	  "format": "Metadata",
	  "mtime": "1472059196",
	  "size": "2161",
	  "md5": "211c37e49363e2977e551156ba9cbec9",
	  "crc32": "334bedba",
	  "sha1": "0730bc3a99c9b9ea48636179250f0b12ed36da26"
	},
	"\/PREVIEW_201402_reviews.xml": {
	  "source": "original",
	  "mtime": "1402972986",
	  "size": "2696",
	  "md5": "d31dfe13995c1a2a2cfe2d5120ddb4e3",
	  "crc32": "6ced6547",
	  "sha1": "f8c06e156243bfc8adb39ae096775140e792004f",
	  "format": "Metadata"
	},
	"\/preview.PNG": {
	  "source": "original",
	  "format": "PNG",
	  "mtime": "1392398928",
	  "size": "74825",
	  "md5": "519e1b737e42ffcf3e4ec38abf148ebb",
	  "crc32": "5f496133",
	  "sha1": "c5efb6f8f56aadcdd080a0e07d7f0294f0477818"
	},
	"\/preview_thumb.jpg": {
	  "source": "derivative",
	  "format": "JPEG Thumb",
	  "original": "preview.PNG",
	  "mtime": "1392398972",
	  "size": "3986",
	  "md5": "5f8aacbd3355c23e4ed24edc4b623a05",
	  "crc32": "925451a7",
	  "sha1": "4765f528cac7fec7e3bd37a65dafbbd73edb77a9"
	}
  },
  "misc": {
	"image": "https:\/\/ia600202.us.archive.org\/5\/items\/PREVIEW_201402\/preview_thumb.jpg",
	"collection-title": "Classic PC Games"
  },
  "item": {
	"downloads": 671,
	"week": 5,
	"month": 12
  }
}