{
  "server": "ia600801.us.archive.org",
  "dir": "/14/items/ShatteredSteelDemo",
  "metadata": {
	"mediatype": [
	  "software"
	],
	"collection": [
	  "classicpcgames"
	],
	"title": [
	  "Shattered Steel Demo"
	],
	"description": [
	  "\"The Year is 2132. Deep space exploration and colonization have become reality. The human race is growing at an incredible rate; man's sphere of influence has been expanding unchallenged for 150 years. Man's universe has split into 2 distinct societies, the highly structured and lawful core worlds and the lawless frontier worlds. The Core Worlds represent the best that humanity has to offer; a peaceful application of technology used for the betterment of mankind. The Frontier Worlds hold the seamy underbelly that the Core Worlds want to forget; a greedy race for the elements the Core Worlds need for expansion. Huge mining and manufacturing corporations compete in the pillage of the outer worlds purely for the generation of profit. To maintain basic order on the outer worlds and to compete with rival companies each corporation maintains a private force for problem solving.\n\nIt was in 2102 when these private forces reached the level of companies and fleets that the Core Navy stepped in at Tarnok IV. The Raw Materials division of Ford Toyota Co. wanted Tarnok IV for the vast minerals that could be stripped from the planet, while Universal Pharmaceuticals saw the planet for its industrial and crop potential. The legal ownership of the planet had been in dispute for more than twenty years so the Sato Group decided to take the planet by force and dedicated 75% of their forces to do so. Universal Pharmaceuticals also sent in their own force. As the first shots began to be fired, the 142nd Battle Fleet, commanded by Rear Admiral Davies, came out of HyperSpace. The Core Navies ships came out with their plasma cannons hot, and torpedoes locked. Without warning the ships opened fire. When the first barrage was over, they had destroyed over three quarters of the ships from both companies. Admiral Davies then demanded a cease fire from all parties.\n\nHis orders had been given days before when it was decided that such a precedent as mass fleet battles by corporations to decide planetary ownership could not be set. The repercussions of this were that the percentage of total employees of a corporation dedicated to security could not exceed 1%. Furthermore the corporations were only allowed to hire mercenaries if they did not employ their own security force, and even then they were restricted in the number that could be hired. Because of these restrictions it became necessary for the corporation to hire or employ heavily armored individuals. They needed to be able to send in one man where they had previously dedicated a thousand. Therefore each of these individuals needed to be a one man army. With enough fire power that they would not need to depend upon reinforcements, or help in any way.\n\nThe Planet Runner was developed specifically for this purpose. The Planet Runner could navigate over most terrain while carrying the fire power of a light armored division, and the defense strength of a small battle ship. A modified corvette class starship provided the living quarters for the one or two man crew, and a highly functional and adaptable computer that could also strip down and rebuild any Planet Runner operating out of the corvette. The back half of the corvette was dedicated to storing parts, and repairing and building Planet Runners. While these one man armies could pacify small towns and uprisings single handily, the Core Worlds do not see them as a threat and allow their existence.\n\nYou play the role of a freelance mercenary on a limited protection contract with a large mining corporation. You operate a Planet Runner used for deep recon missions and planetary pacification. You patrol a section near the edge of known space which is frequently plagued by pirates and subject to frequent raids. At the start of the game a mining camp on Lanios 3 (a planet under your jurisdiction) has stopped following the usual communication protocols. You are called in to investigate.\n\nThe corporation is quite certain that an extensive pirate raid is occurring on the surface of Lanios 3, there were numerous disturbances reported just prior to the loss of contact. As per standard defense protocol you have been given free reign to react to any threat. \""
	],
	"subject": [
	  "DOS games; Vintage computer games; Action games"
	],
	"creator": [
	  "BioWare"
	],
	"identifier": [
	  "ShatteredSteelDemo"
	],
	"addeddate": [
	  "2012-07-08 22:36:14"
	],
	"date": [
	  "1996"
	],
	"year": [
	  "1996"
	],
	"publisher": [
	  "Interplay"
	],
	"publicdate": [
	  "2012-07-08 22:37:24"
	],
	"curation": [
	  "[curator]jscott@archive.org[\/curator][date]20140308004704[\/date][state]un-dark[\/state][comment]Darked by Mistake[\/comment]"
	],
	"backup_location": [
	  "ia903806_21"
	]
  },
  "files": {
	"\/ShatteredSteelDemo_archive.torrent": {
	  "source": "original",
	  "btih": "2fbf1ced3063dd9fc1b13b113d66f404d65e2d3d",
	  "mtime": "1462118314",
	  "size": "2495",
	  "md5": "b936537007d14640958cb16623615fa3",
	  "crc32": "a53fbb56",
	  "sha1": "76db8eccc9b410dbd3d31add31351379026316c9",
	  "format": "Archive BitTorrent"
	},
	"\/ShatteredSteelDemo_files.xml": {
	  "source": "original",
	  "format": "Metadata",
	  "md5": "6d8e3b8b61b7eb77cf2ea4c2c389bf22"
	},
	"\/ShatteredSteelDemo_meta.xml": {
	  "source": "original",
	  "format": "Metadata",
	  "mtime": "1462118313",
	  "size": "4946",
	  "md5": "be005b6e74807516f05b99d9675c3a7b",
	  "crc32": "f742ae6b",
	  "sha1": "1bac1435dbb3ae0b01d6e9c1a74bba491a69dd24"
	},
	"\/resource_item_259.jpg": {
	  "source": "original",
	  "format": "JPEG",
	  "mtime": "1341786903",
	  "size": "11277",
	  "md5": "fcbd128883f9e2e7297ead4a65d5e14c",
	  "crc32": "4e5472c9",
	  "sha1": "fc2b62c2588709ab767785d05c83a7ac0696a3a6",
	  "rotation": "0"
	},
	"\/resource_item_259_thumb.jpg": {
	  "source": "derivative",
	  "format": "JPEG Thumb",
	  "original": "resource_item_259.jpg",
	  "mtime": "1341786987",
	  "size": "3947",
	  "md5": "5be30933988798cf872826cf2ea0ab0d",
	  "crc32": "7402e80b",
	  "sha1": "453acd1b6507ca600416712b51c3ca3dff77c0eb"
	},
	"\/ssdemo11.zip": {
	  "source": "original",
	  "format": "ZIP",
	  "mtime": "1341786968",
	  "size": "16557056",
	  "md5": "a9fe825d343b22842b48abd03f977b70",
	  "crc32": "1916edbc",
	  "sha1": "14f8c624d8b5a6075d535b504dbce6142c23504a"
	}
  },
  "misc": {
	"image": "https:\/\/ia600801.us.archive.org\/14\/items\/ShatteredSteelDemo\/resource_item_259_thumb.jpg",
	"collection-title": "Classic PC Games"
  },
  "item": {
	"downloads": 193,
	"week": 2,
	"month": 6
  }
}