{
  "server": "ia601504.us.archive.org",
  "dir": "/35/items/TVPC32",
  "metadata": {
	"identifier": [
	  "TVPC32"
	],
	"mediatype": [
	  "software"
	],
	"collection": [
	  "classicpcgames"
	],
	"creator": [
	  "Ben Marty"
	],
	"date": [
	  "1997"
	],
	"description": [
	  " If you're new to TechnoVenture, it is an arcade-style puzzle solving side-scrolling adventure game. This version was written for 32-bit systems supporting DirectX. If you've seen the DOS version of TechnoVenture this version should be more stable, more enjoyable and more flexible. TechnoVenture now has music and much better sound effects. You can also drag the game window and the inventory to suitable positions fitting your preference, and resize and make other adjustments to the game window. The only drawback is that, if you don't have a suitable system (I believe any 486\/66 MHz system or better with at least 1 MB of video memory that supports DirectX would be suitable), TechnoVenture 2.0 may run incredibly slow on your system. However, if you have a good system, it appears to me that the DirectX version *could* run faster than the DOS version (which is too fast anyway if you have a good system). Currently, this version of TechnoVenture is also completely compatible with the DOS version and uses the exact same \"maps\" or \"worlds\". There is one minor compatibility problem with the DOS version though. Recording a demo in one version of TechnoVenture and playing it back in another may not work as expected if the player interacted with moving objects (especially platforms). It is possible, however, that the demo will play acceptably, and as a matter of fact, the demo that was distributed with the DOS version does work with the new version. <div><br \/><\/div><div>There are a few main points of attraction in TechnoVenture. First of all, TechnoVenture has plot. Unlike many games where you run around shooting mindlessly at anything that moves, TechnoVenture involves the player more in events that are happening and presents puzzles to solve and can develop a plot through text messages. The player can talk to people, read signs and make observations about the environment. Second, TechnoVenture supports custom level creation. When you receive TechnoVenture, you receive a number of \"maps\" which are like pieces of the game. These were created for distribution with the game. But that's not the end. Others can develop their own pieces to the game and add to it! If you register TechnoVenture at the developer level (see \"Registration\"), you too can develop your own pieces to the game and make those pieces available to everyone else who owns TechnoVenture via the TechnoVenture homepage (http:\/\/members.aol.com\/BlueMonkMN\/TechnoVenture.html). Finally, for worried parents out there having trouble finding suitable games that don't involve \"blood and gore\", I tried to reduce violence in TechnoVenture to almost nothing while still keeping the game enjoyable. I didn't want to spend the extra effort to draw all that anyway :).<\/div>"
	],
	"license": [
	  "shareware"
	],
	"scanner": [
	  "Internet Archive HTML5 Uploader 1.6.3"
	],
	"subject": [
	  "Windows games; Vintage computer games; Puzzle games"
	],
	"title": [
	  "TechnoVenture v2.0"
	],
	"year": [
	  "1997"
	],
	"publicdate": [
	  "2017-03-15 02:36:47"
	],
	"addeddate": [
	  "2017-03-15 02:36:47"
	]
  },
  "files": {
	"\/Clipboard-20170314-03.png": {
	  "source": "original",
	  "mtime": "1489545422",
	  "size": "11409",
	  "md5": "103faa18505deacb1dd96be3271e4cb8",
	  "crc32": "7a343839",
	  "sha1": "b5cfce17896ba376745c2c940fbd7cc4a109b3d5",
	  "format": "PNG"
	},
	"\/Clipboard-20170314-03_thumb.jpg": {
	  "source": "derivative",
	  "format": "JPEG Thumb",
	  "original": "Clipboard-20170314-03.png",
	  "mtime": "1489545439",
	  "size": "2955",
	  "md5": "8bca3205831e35fcf80e95d28705b36d",
	  "crc32": "bf7a31a6",
	  "sha1": "3b27a7f54362809e1c1088f1e83850d8bed59281"
	},
	"\/TVPC32.zip": {
	  "source": "original",
	  "mtime": "1489545406",
	  "size": "268568",
	  "md5": "41b149eff1a1d1e20014438acc1e226e",
	  "crc32": "c46c107d",
	  "sha1": "a35bdfb09ae957aafa962e90b59dd114b8d1eaab",
	  "format": "ZIP"
	},
	"\/TVPC32_archive.torrent": {
	  "source": "original",
	  "btih": "ef4f55db9fca7e8117bc76da0026a361fcda228c",
	  "mtime": "1489545441",
	  "size": "1952",
	  "md5": "29e989d075a6d6284039321122f1c787",
	  "crc32": "e380160e",
	  "sha1": "59c0ae04c09574efe908aac293809ec07d570cb7",
	  "format": "Archive BitTorrent"
	},
	"\/TVPC32_files.xml": {
	  "source": "original",
	  "format": "Metadata",
	  "md5": "a2c78e90ae61380d841e3363fcf5c90d"
	},
	"\/TVPC32_meta.sqlite": {
	  "source": "original",
	  "mtime": "1489545427",
	  "size": "26624",
	  "md5": "d626bf083b51dabf4b02a28d44dcde24",
	  "crc32": "5aeea383",
	  "sha1": "9028eb7ec83f7a62f2ec2242d30d27b85db3cd36",
	  "format": "Metadata"
	},
	"\/TVPC32_meta.xml": {
	  "source": "original",
	  "mtime": "1489545431",
	  "size": "3349",
	  "md5": "4929682ec6e54ea7265cf5475d8d003b",
	  "crc32": "d2f90fef",
	  "sha1": "08612299ab93b814215a5bf08144cce0e5a617b2",
	  "format": "Metadata"
	}
  },
  "misc": {
	"image": "https:\/\/ia601504.us.archive.org\/35\/items\/TVPC32\/Clipboard-20170314-03_thumb.jpg",
	"collection-title": "Classic PC Games"
  },
  "item": {
	"downloads": 15,
	"week": 5,
	"month": 6
  }
}