{
  "server": "ia600805.us.archive.org",
  "dir": "/6/items/WartornDemo",
  "metadata": {
	"identifier": [
	  "WartornDemo"
	],
	"title": [
	  "WarTorn Demo"
	],
	"creator": [
	  "Eyst"
	],
	"mediatype": [
	  "software"
	],
	"collection": [
	  "classicpcgames"
	],
	"description": [
	  "Developed in ancient times as a means of controlling a population too great to be supported by the limited resources and technology available. Participants in these events were revered like the GODS of war they became. All too often though, they were forced into these events as the only means available to support their families. If they survived, it was only a temporary reprieve from what must be considered a determined fate of continual participation till death.\n\nEach team in these War Tournaments would play under the direction of a highly skilled warlord. It was the warlords strategic ability that would ultimately determine the outcome for his team.\n\nThese events were eventually discontinued, deemed unnecessary by governments, even though they were shown to be effective and very popular with the spectators.\n\nThe year is now 2999 AD and WarTorn, as it is now known, is set for a revival. The people of the world are understandably nervous, and yet uncomfortably excited by the prospect of controlled war. There hasn't been a major conflict of any significance for centuries, and all the other sports have become so  mundane that they have been relegated to very niche markets. The world was just screaming out for a little spice to break the boredom. \n\nHumans need conflict and that's a fact. If you're not involved in conflict, then you sure as hell want someone else's to look at. WarTorn has fantastic prize packages on offer so the response from would be Warlords and others, destined to be cannon fodder, has been extreme, to say the least. Anyone can fit the role of a natural born killer, given the right encouragement, but the teams do have to be selective. After all if your not winning, the sponsors will not be happy and may pull out.\n\nYou have to pass psychological examination from the team shrink. This will also determine you responsibility within the team. Only those with the most brilliant and twisted minds become Warlords. Competition for this position is fierce, and a fair amount of off field skullduggery has been taking place. \n\nThe rules have changed little, since ancient times, as far as can be accurately determined anyway. The technology used for combat is restricted by tournament themes, with the initial theme having been determined by a populous vote, to be 20th century, a nostalgic era to be sure. The PSS (Public Sports Service) has bought the rights to televise the events worldwide. Massive war arenas have been built worldwide in preparation for the start of the first season, commencing on new years day 3000 AD.\n\nThe controlling body FIWA has strict guidelines on all aspects of WarTorn. For example, the arenas must be at least 2 kilometers square and scalable using the official \"Terra Tech\" arena modifier, up to 10 kilometers square. They can be of any topographical composition, with no limit placed on the type and number of hazards contained. All arenas are inspected by FIWA official and certified to support up to a given number of teams in any one tournament. The number of suitable base areas and amount of resources deposited in the arena are the main guides for the rating given. Designers, the guidelines say, should always keep in mind that WarTorn is a controlled spectator war sport and as such, the layout of the arena should be conducive to great battles and great television.\n\nThe Teams warlord may select from a package of endorsed 20th century weaponry replica components. The tools for on field manufacture and modification of are supplied through FIWA, along with an initial quantity of resources, to be used for the establishment of a base. During the course of a tournament, resources are to be mined with pre-fabricated extraction buildings. Raw resources are included in the arena design and are utilized by the teams to provide ongoing materials for the war effort. An efficient design in the layout of a base is considered to be a prime element in determining the outcome of a tournament.\n\nA free trade system operates during the course of a tournament, whereby the warlord can exchange raw or processed materials for finished war machines and troops offered by other warlords. The tournament referee may also offer other items up to stimulate the war spectacle if this is deemed necessary."
	],
	"date": [
	  "2000"
	],
	"year": [
	  "2000"
	],
	"subject": [
	  "Windows games; Vintage computer games; Strategy games"
	],
	"publicdate": [
	  "2012-02-21 07:22:57"
	],
	"addeddate": [
	  "2012-02-21 07:22:32"
	],
	"publisher": [
	  "Virgin Interactive"
	],
	"updatedate": [
	  "2012-02-21 07:24:36"
	],
	"updater": [
	  "Swizzley"
	],
	"curation": [
	  "[curator]jscott@archive.org[\/curator][date]20140308004704[\/date][state]un-dark[\/state][comment]Darked by Mistake[\/comment]"
	],
	"backup_location": [
	  "ia903709_7"
	]
  },
  "files": {
	"\/WARTORN.EXE": {
	  "source": "original",
	  "format": "Windows Executable",
	  "mtime": "1329808879",
	  "size": "26349568",
	  "md5": "dba20e5f9dede2901a1b02240237a268",
	  "crc32": "8779cf80",
	  "sha1": "5a8cbe802b782a6ee6925badf5567d0aedbe5b7d",
	  "title": "WarTorn Demo"
	},
	"\/WartornDemo_archive.torrent": {
	  "source": "original",
	  "btih": "0cea7f183cea28fc88b5489cfdf308029a5afdb8",
	  "mtime": "1462025985",
	  "size": "2817",
	  "md5": "e07f330dd3c57acf29b8cbfac56fe2a3",
	  "crc32": "ed143eb6",
	  "sha1": "2890f45f27a04f059bd0f92f7409add88690cb55",
	  "format": "Archive BitTorrent"
	},
	"\/WartornDemo_files.xml": {
	  "source": "original",
	  "format": "Metadata",
	  "md5": "d0ed1c2bce1cd90a66ff191f7a4b6381"
	},
	"\/WartornDemo_meta.xml": {
	  "source": "original",
	  "format": "Metadata",
	  "mtime": "1462025984",
	  "size": "5099",
	  "md5": "d300effd53fae4e10c4730f8142ed9b4",
	  "crc32": "dba544a7",
	  "sha1": "9eca9f4d4423e4328b14b9562a8e828894e2ea5b"
	},
	"\/WartornScreenshot.jpg": {
	  "source": "original",
	  "format": "JPEG",
	  "title": "WarTorn Screenshot",
	  "mtime": "1329808796",
	  "size": "23516",
	  "md5": "d36c0b34c7f332ff73ac6f522a3ae7e0",
	  "crc32": "3ef28add",
	  "sha1": "64009ac643750d21fb7aeb6a3c64dade3d49f656",
	  "rotation": "0"
	},
	"\/WartornScreenshot_thumb.jpg": {
	  "source": "derivative",
	  "format": "JPEG Thumb",
	  "original": "WartornScreenshot.jpg",
	  "mtime": "1329808968",
	  "size": "3578",
	  "md5": "e824642ed3867745cb8c073b19c8f072",
	  "crc32": "dbe5dfc3",
	  "sha1": "9e836586c2a145e222cd3f82c097e2d397626be2"
	}
  },
  "misc": {
	"image": "https:\/\/ia600805.us.archive.org\/6\/items\/WartornDemo\/WartornScreenshot_thumb.jpg",
	"collection-title": "Classic PC Games"
  },
  "item": {
	"downloads": 237,
	"week": 3,
	"month": 9
  }
}